Repository: caspahouzer/slk-cpt-table-engine
Catalog: languages/slk-cpt-table-engine-*.po
Languages: de_de

source: Optimizes database performance by storing Custom Post Types in dedicated custom tables instead of wp_posts and wp_postmeta.
de_de: Optimiert die Datenbankleistung, indem benutzerdefinierte Beitragstypen in dedizierten benutzerdefinierten Tabellen anstelle von wp_posts und wp_postmeta gespeichert werden.

source: You do not have permission to perform this action.
de_de: Du hast keine Berechtigung, diese Aktion auszuführen.

source: Invalid post type.
de_de: Ungültiger Beitragstyp.

source: Custom table enabled successfully.
de_de: Benutzerdefinierte Tabelle erfolgreich aktiviert.

source: Custom table disabled successfully.
de_de: Benutzerdefinierte Tabelle erfolgreich deaktiviert.

source: Settings
de_de: Einstellungen

source: Are you sure you want to disable custom table storage for this post type? All data will be migrated back to wp_posts and wp_postmeta.
de_de: Bist du sicher, dass du die Speicherung in benutzerdefinierten Tabellen für diesen Beitragstyp deaktivieren möchtest? Alle Daten werden zurück zu wp_posts und wp_postmeta migriert.

source: Migrating...
de_de: Migriere...

source: Migration completed successfully!
de_de: Migration erfolgreich abgeschlossen!

source: Migration failed. Please check the error log.
de_de: Migration fehlgeschlagen. Bitte überprüfe das Fehlerprotokoll.

source: You do not have sufficient permissions to access this page.
de_de: Du hast keine ausreichenden Berechtigungen, um auf diese Seite zuzugreifen.

source: Enable custom table storage for specific Custom Post Types to optimize database performance.
de_de: Aktiviere die Speicherung in benutzerdefinierten Tabellen für bestimmte benutzerdefinierte Beitragstypen, um die Datenbankleistung zu optimieren.

source: No custom post types found. Custom post types will appear here once registered.
de_de: Keine benutzerdefinierten Beitragstypen gefunden. Benutzerdefinierte Beitragstypen werden hier angezeigt, sobald sie registriert sind.

source: Post Type
de_de: Beitragstyp

source: Label
de_de: Bezeichnung

source: Custom Table Storage
de_de: Custom Table Speicher

source: Using custom table
de_de: Verwendet benutzerdefinierte Tabelle

source: Using wp_posts
de_de: Verwendet wp_posts

source: How It Works
de_de: So funktioniert es

source: When enabled, posts of the selected type are stored in dedicated custom tables instead of wp_posts.
de_de: Wenn aktiviert, werden Beiträge des ausgewählten Typs in dedizierten benutzerdefinierten Tabellen anstelle von wp_posts gespeichert.

source: This can significantly improve query performance for post types with large datasets.
de_de: Dies kann die Abfrageleistung für Beitragstypen mit großen Datenmengen erheblich verbessern.

source: All existing posts are automatically migrated when you enable custom table storage.
de_de: Alle vorhandenen Beiträge werden automatisch migriert, wenn du die Speicherung in benutzerdefinierten Tabellen aktivierst.

source: You can safely switch back to wp_posts at any time - all data will be migrated back.
de_de: Du kannst jederzeit sicher zu wp_posts zurückwechseln - alle Daten werden zurückmigriert.

source: WP_Query and all standard WordPress functions continue to work normally.
de_de: WP_Query und alle Standard-WordPress-Funktionen funktionieren weiterhin normal.

source: Could not insert post into database.
de_de: Beitrag konnte nicht in die Datenbank eingefügt werden.

source: Invalid post ID.
de_de: Ungültige Beitrags-ID.

source: Could not update post in database.
de_de: Beitrag konnte in der Datenbank nicht aktualisiert werden.

source: Could not delete post from database.
de_de: Beitrag konnte nicht aus der Datenbank gelöscht werden.

source: Post title is required.
de_de: Beitragstitel ist erforderlich.

source: Post type is required.
de_de: Beitragstyp ist erforderlich.

source: Invalid post status.
de_de: Ungültiger Beitragsstatus.

source: Invalid post author.
de_de: Ungültiger Beitragsautor.

source: Failed to migrate post meta.
de_de: Migration der Beitrags-Metadaten fehlgeschlagen.

source: Migrated %1$d of %2$d meta entries...
de_de: Migriere %1$d/%2$d Meta-Einträge...

source: Failed to migrate post meta back to wp_postmeta.
de_de: Migration der Beitrags-Metadaten zurück zu wp_postmeta fehlgeschlagen.

source: Migrated %1$d of %2$d meta entries back to wp_postmeta...
de_de: Migriere %1$d/%2$d Meta-Einträge zurück...

source: Failed to create custom tables.
de_de: Benutzerdefinierte Tabellen konnten nicht erstellt werden.

source: Custom tables do not exist.
de_de: Benutzerdefinierte Tabellen existieren nicht.

source: Migration started...
de_de: Migration gestartet...

source: Failed to migrate posts.
de_de: Migration der Beiträge fehlgeschlagen.

source: Migrated %1$d of %2$d posts...
de_de: Migriere %1$d/%2$d Beiträge…

source: Failed to migrate posts back to wp_posts.
de_de: Migration der Beiträge zurück zu wp_posts fehlgeschlagen.

source: Migrated %1$d of %2$d posts back to wp_posts...
de_de: Migriere %1$d/%2$d Beiträge zurück…

source: CPT Table Engine cannot be deactivated!
de_de: CPT Table Engine kann nicht deaktiviert werden!

source: You must migrate all Custom Post Types back to wp_posts before deactivating this plugin. Please go to the %s and disable all CPTs first.
de_de: Du musst alle benutzerdefinierten Beitragstypen zurück zu wp_posts migrieren, bevor du dieses Plugin deaktivieren kannst. Bitte gehe zur %s und deaktiviere zuerst alle CPTs.

source: settings page
de_de: Einstellungsseite

source: Important:
de_de: Wichtig:

source: Before deactivating this plugin, you must disable all CPTs. This ensures all data is safely migrated back to wp_posts.
de_de: Bevor du dieses Plugin deaktivierst, musst du alle CPTs deaktivieren. Dies stellt sicher, dass alle Daten sicher zurück zu wp_posts migriert werden.

source: Reticulating splines...
de_de: Kurven werden retikuliert...

source: Gerbil feeding time...
de_de: Rennmaus-Fütterungszeit...

source: Recalibrating flux capacitor...
de_de: Flusskompensator wird neu kalibriert...

source: Bending the space-time continuum...
de_de: Raum-Zeit-Kontinuum wird gebogen...

source: Definitely not downloading a car...
de_de: Definitiv kein Auto am Herunterladen...

source: Dividing by zero...
de_de: Durch Null teilen...

source: Twiddling thumbs...
de_de: Daumen drehen...

source: Warming up the hamsters...
de_de: Hamster werden aufgewärmt...

source: It's not you, it's me...
de_de: Es liegt nicht an dir, sondern an mir...

source: Constructing additional pylons...
de_de: Zusätzliche Pylonen werden konstruiert...

source: Compiling the internet...
de_de: Internet wird kompiliert...

source: Debugging the coffee machine...
de_de: Kaffeemaschine wird debuggt...

source: Converting caffeine to code...
de_de: Koffein wird in Code umgewandelt...

source: Optimizing SQL queries nobody will read...
de_de: SQL-Abfragen optimieren, die niemand lesen wird...

source: Teaching robots to love...
de_de: Robotern das Lieben beibringen...

source: Untangling Ethernet cables...
de_de: Ethernet-Kabel entwirren...

source: Reversing the polarity...
de_de: Polarität wird umgekehrt...

source: Summoning the database gremlins...
de_de: Datenbank-Gremlins werden beschworen...

source: Applying percussive maintenance...
de_de: Perkussive Wartung wird angewendet...

source: Installing Adobe Reader...
de_de: Adobe Reader wird installiert...
